# # ===========================if语法==============================
# '''
#     if 条件:
#         条件成立执行代码1
#         条件成立执行代码2
#         ...
# '''
# if True:
#     print('条件成立执行代码1')
#     print('条件成立执行代码2')
# print('条件成立执行代码3')
# if False:
#     print('条件成立执行代码1')
#     print('条件成立执行代码2')
# print('条件成立执行代码3') # if条件不成立就不执行里面的代码块，缩进外的代码与if条件成立与否无关，都要执行
#
# # ===========================if实例==============================
# age = int(input('请输入年龄:'))
# if age >= 18:
#     print(f'用户年龄为{age}岁，允许上网')
# print('系统关闭')
#
# # ===========================if else==============================
# age = int(input('请输入年龄：'))
# if age >= 18:
#     print(f'用户年龄为{age}岁，允许上网')
# else:
#     print('未成年人禁止上网')
#
# # ===========================多重判断==============================
# '''
#     if 条件1:
#         条件成立执行代码1
#     elif 条件2：
#         条件成立执行代码2
#     else
#         条件不成立执行代码3
# '''
# age = int(input('请输入年龄：'))
# if age < 18:
#     print('用户年龄小于18岁,不合法')
# elif age < 60:
#     print(f'用户年龄为{age},合法工龄')
# else:
#     print('用户年龄大于60岁，不合法')
#
# # ===========================if嵌套==============================
# '''
#     if 条件1:
#         条件成立执行代码1
#         if 条件2：
#             条件成立执行代码2
# '''
#
# money = 1
# seat = 1
# if money == 1:
#     print('已买票，可上车')
#     if seat == 1:
#         print('有空座位')
#     else:
#         print('无空座位')
# else:
#     print('未买票，不可上车')
#
# # ===========================if实例：猜拳游戏==========================
# import random
# # 1. 出拳
# # 玩家出拳
# player = int(input('请出拳:0--石头，1--剪刀，2--布'))
# # 电脑出拳
# computer = random.randint(0,2)  # random.randint(开始,结束) 随机整数功能
# print(computer)
# # 2. 判断输赢
# if ((player == 0)and(computer == 1)) or ((player == 1)and(computer == 2)) or ((player == 2)and(computer == 0)):
#     print('玩家获胜')
# elif player == computer:
#     print('平局')
# else:
#     print('电脑获胜')

# ===========================三目运算符==========================
a = 1
b = 2
c = a if a > b else b
# 条件成⽴执⾏的表达式 if 条件 else 条件不成⽴执⾏的表达式
print(c)















