# =================创建集合============================
# 1. 创建集合使⽤ {} 或 set() ， 但是如果要创建空集合只能使⽤ set() ，因为 {} ⽤来创建空字典
# 2. 集合可以去掉重复数据
# 3. 集合数据是⽆序的，故不⽀持下标
s1 = {10, 20, 30, 40, 50}
print(s1)
s3 = set('abcdefg')
print(s3)
s4 = set()
print(type(s4)) # set
s5 = {}
print(type(s5)) # dict

# =================集合的增操作============================
# add()
s1 = {10, 20}
s1.add(100)
s1.add(10)
print(s1) # {100, 10, 20} 去重

# update()：追加的数据是序列
s1 = {10, 20}
# s1.update(100) # error
s1.update([100, 200])
s1.update('abc')
print(s1)  # {'a', 'c', 100, 200, 10, 'b', 20}

# =================集合的删操作============================
# remove()：删除集合中的指定数据，如果数据不存在则报错
s1 = {10, 20}
s1.remove(10)
print(s1)
# s1.remove(10) # errpr
print(s1)

# discard():删除集合中的指定数据，但数据不存在不会报错
s1 = {10, 20}
s1.discard(10)
print(s1)
s1.discard(10)
print(s1)

# pop()：随机删除集合中的某个数据，并返回这个数据
s1 = {10, 20, 30, 40, 50}
del_num = s1.pop()
print(del_num) # 40
print(s1)  # {10, 50, 20, 30}

# =================集合的查操作============================
# in：判断数据在集合序列
# not in：判断数据不在集合序列
s1 = {10, 20, 30, 40, 50}
print(10 in s1)  # True
print(10 not in s1)  # False




















